feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Prog/Libraries/Infra/Sfr/TC27D/_Reg/IfxXbar_regdef.h
/** \brief  Access Enable Register 1 */
typedef struct _Ifx_XBAR_ACCEN1_Bits
{
    unsigned int reserved_0:32;             /**< \brief \internal Reserved */
} Ifx_XBAR_ACCEN1_Bits;

/** \brief  Arbiter Control Register */
typedef struct _Ifx_XBAR_ARBCON_Bits
{
    unsigned int PRERREN:1;                 /**< \brief [0:0] SRI Protocol Error Enable (rw) */
    unsigned int SCERREN:1;                 /**< \brief [1:1] SRI Starvation Error Enable (rw) */
    unsigned int SETPRINT:1;                /**< \brief [2:2] Set SRI Protocol Interrupt (rwh) */
    unsigned int SETSCINT:1;                /**< \brief [3:3] Set SRI Starvation Interrupt (rwh) */
    unsigned int INTACK:1;                  /**< \brief [4:4] Interrupt Acknowledge (rwh) */
    unsigned int reserved_5:15;             /**< \brief \internal Reserved */
    unsigned int SPC:12;                    /**< \brief [31:20] Starvation Protection Counter Reload Value (rw) */
} Ifx_XBAR_ARBCON_Bits;

/** \brief  Debug Address Register */
typedef struct _Ifx_XBAR_ARBITER0_DBADD_Bits
{
    unsigned int reserved_0:27;             /**< \brief \internal Reserved */
    unsigned int ADDRESS:1;                 /**< \brief [27:27] Debug Address Boundary (rw) */
    unsigned int reserved_28:4;             /**< \brief \internal Reserved */
} Ifx_XBAR_ARBITER0_DBADD_Bits;

/** \brief  Debug Mask Address Register */
typedef struct _Ifx_XBAR_ARBITER0_DBMADD_Bits
{
    unsigned int reserved_0:2;              /**< \brief \internal Reserved */
    unsigned int ADDRESS:19;                /**< \brief [20:2] Debug Address Boundary (rw) */
    unsigned int reserved_21:11;            /**< \brief \internal Reserved */
} Ifx_XBAR_ARBITER0_DBMADD_Bits;

/** \brief  Debug Address Register */
typedef struct _Ifx_XBAR_ARBITER1_DBADD_Bits
{
    unsigned int reserved_0:31;             /**< \brief \internal Reserved */
    unsigned int ADDRESS:1;                 /**< \brief [31:31] Debug Address Boundary (rw) */
} Ifx_XBAR_ARBITER1_DBADD_Bits;

/** \brief  Debug Mask Address Register */
typedef struct _Ifx_XBAR_ARBITER1_DBMADD_Bits
{
    unsigned int reserved_0:31;             /**< \brief \internal Reserved */
    unsigned int ADDRESS:1;                 /**< \brief [31:31] Debug Address Boundary (rw) */
} Ifx_XBAR_ARBITER1_DBMADD_Bits;

/** \brief  Debug Address Register */
typedef struct _Ifx_XBAR_ARBITER2_DBADD_Bits
{
    unsigned int reserved_0:2;              /**< \brief \internal Reserved */
    unsigned int ADDRESS0:19;               /**< \brief [20:2] Debug Address Boundary (rw) */
    unsigned int reserved_21:2;             /**< \brief \internal Reserved */
    unsigned int ADDRESS1:1;                /**< \brief [23:23] Debug Address Boundary (rw) */
    unsigned int reserved_24:3;             /**< \brief \internal Reserved */
    unsigned int ADDRESS2:1;                /**< \brief [27:27] Debug Address Boundary (rw) */
    unsigned int ONE0:1;                    /**< \brief [28:28] Reserved (r) */
    unsigned int ADDRESS3:1;                /**< \brief [29:29] Debug Address Boundary (rw) */
    unsigned int ONE1:1;                    /**< \brief [30:30] Reserved (r) */
    unsigned int ADDRESS4:1;                /**< \brief [31:31] Debug Address Boundary (rw) */
} Ifx_XBAR_ARBITER2_DBADD_Bits;

/** \brief  Debug Mask Address Register */
typedef struct _Ifx_XBAR_ARBITER2_DBMADD_Bits
{
    unsigned int reserved_0:2;              /**< \brief \internal Reserved */
    unsigned int ADDRESS0:19;               /**< \brief [20:2] Debug Address Boundary (rw) */
    unsigned int ONE0:2;                    /**< \brief [22:21] Reserved (r) */
    unsigned int ADDRESS1:1;                /**< \brief [23:23] Debug Address Boundary (rw) */
    unsigned int ONE1:3;                    /**< \brief [26:24] Reserved (r) */
    unsigned int ADDRESS2:1;                /**< \brief [27:27] Debug Address Boundary (rw) */
    unsigned int ONE2:1;                    /**< \brief [28:28] Reserved (r) */
    unsigned int ADDRESS3:1;                /**< \brief [29:29] Debug Address Boundary (rw) */
    unsigned int ONE3:1;                    /**< \brief [30:30] Reserved (r) */
    unsigned int ADDRESS4:1;                /**< \brief [31:31] Debug Address Boundary (rw) */
} Ifx_XBAR_ARBITER2_DBMADD_Bits;

/** \brief  Debug Address Register */
typedef struct _Ifx_XBAR_ARBITER4_DBADD_Bits
{
    unsigned int reserved_0:2;              /**< \brief \internal Reserved */
    unsigned int ADDRESS:29;                /**< \brief [30:2] Debug Address Boundary (rw) */
    unsigned int reserved_31:1;             /**< \brief \internal Reserved */
} Ifx_XBAR_ARBITER4_DBADD_Bits;

/** \brief  Debug Mask Address Register */
typedef struct _Ifx_XBAR_ARBITER4_DBMADD_Bits
{
    unsigned int reserved_0:2;              /**< \brief \internal Reserved */
    unsigned int ADDRESS:29;                /**< \brief [30:2] Debug Address Boundary (rw) */
    unsigned int reserved_31:1;             /**< \brief \internal Reserved */
} Ifx_XBAR_ARBITER4_DBMADD_Bits;

/** \brief  Debug Address Register */
typedef struct _Ifx_XBAR_ARBITER6_DBADD_Bits
{
    unsigned int reserved_0:2;              /**< \brief \internal Reserved */
    unsigned int ADDRESS0:25;               /**< \brief [26:2] Debug Address Boundary (rw) */
    unsigned int ONE0:1;                    /**< \brief [27:27] Reserved (r) */
    unsigned int ADDRESS1:3;                /**< \brief [30:28] Debug Address Boundary (rw) */
    unsigned int ONE1:1;                    /**< \brief [31:31] Reserved (r) */
} Ifx_XBAR_ARBITER6_DBADD_Bits;

/** \brief  Debug Mask Address Register */
typedef struct _Ifx_XBAR_ARBITER6_DBMADD_Bits
{
    unsigned int reserved_0:2;              /**< \brief \internal Reserved */
    unsigned int ADDRESS0:25;               /**< \brief [26:2] Debug Address Boundary (rw) */
    unsigned int ONE0:1;                    /**< \brief [27:27] Reserved (r) */
    unsigned int ADDRESS1:3;                /**< \brief [30:28] Debug Address Boundary (rw) */
    unsigned int ONE1:1;                    /**< \brief [31:31] Reserved (r) */
} Ifx_XBAR_ARBITER6_DBMADD_Bits;

