feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Prog/Libraries/Infra/Sfr/TC27D/_Reg/IfxXbar_regdef.h
/** \brief  Access Enable Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_XBAR_ACCEN1_Bits B;                 /**< \brief Bitfield access */
} Ifx_XBAR_ACCEN1;

/** \brief  Arbiter Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_XBAR_ARBCON_Bits B;                 /**< \brief Bitfield access */
} Ifx_XBAR_ARBCON;

/** \brief  Debug Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_XBAR_ARBITER0_DBADD_Bits B;         /**< \brief Bitfield access */
} Ifx_XBAR_ARBITER0_DBADD;

/** \brief  Debug Mask Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_XBAR_ARBITER0_DBMADD_Bits B;        /**< \brief Bitfield access */
} Ifx_XBAR_ARBITER0_DBMADD;

/** \brief  Debug Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_XBAR_ARBITER1_DBADD_Bits B;         /**< \brief Bitfield access */
} Ifx_XBAR_ARBITER1_DBADD;

/** \brief  Debug Mask Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_XBAR_ARBITER1_DBMADD_Bits B;        /**< \brief Bitfield access */
} Ifx_XBAR_ARBITER1_DBMADD;

/** \brief  Debug Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_XBAR_ARBITER2_DBADD_Bits B;         /**< \brief Bitfield access */
} Ifx_XBAR_ARBITER2_DBADD;

/** \brief  Debug Mask Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_XBAR_ARBITER2_DBMADD_Bits B;        /**< \brief Bitfield access */
} Ifx_XBAR_ARBITER2_DBMADD;

/** \brief  Debug Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_XBAR_ARBITER4_DBADD_Bits B;         /**< \brief Bitfield access */
} Ifx_XBAR_ARBITER4_DBADD;

/** \brief  Debug Mask Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_XBAR_ARBITER4_DBMADD_Bits B;        /**< \brief Bitfield access */
} Ifx_XBAR_ARBITER4_DBMADD;

/** \brief  Debug Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_XBAR_ARBITER6_DBADD_Bits B;         /**< \brief Bitfield access */
} Ifx_XBAR_ARBITER6_DBADD;

/** \brief  Debug Mask Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_XBAR_ARBITER6_DBMADD_Bits B;        /**< \brief Bitfield access */
} Ifx_XBAR_ARBITER6_DBMADD;

/** \brief  Debug Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_XBAR_ARBITER7_DBADD_Bits B;         /**< \brief Bitfield access */
} Ifx_XBAR_ARBITER7_DBADD;

/** \brief  Debug Mask Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_XBAR_ARBITER7_DBMADD_Bits B;        /**< \brief Bitfield access */
} Ifx_XBAR_ARBITER7_DBMADD;

/** \brief  Debug Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_XBAR_ARBITER8_DBADD_Bits B;         /**< \brief Bitfield access */
} Ifx_XBAR_ARBITER8_DBADD;

/** \brief  Debug Mask Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_XBAR_ARBITER8_DBMADD_Bits B;        /**< \brief Bitfield access */
} Ifx_XBAR_ARBITER8_DBMADD;

/** \brief  Debug Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_XBAR_ARBITERD_DBADD_Bits B;         /**< \brief Bitfield access */
} Ifx_XBAR_ARBITERD_DBADD;

/** \brief  Debug Mask Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_XBAR_ARBITERD_DBMADD_Bits B;        /**< \brief Bitfield access */
} Ifx_XBAR_ARBITERD_DBMADD;

/** \brief  Debug Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_XBAR_DBCON_Bits B;                  /**< \brief Bitfield access */
} Ifx_XBAR_DBCON;

/** \brief  Debug Trigger Event Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_XBAR_DBSAT_Bits B;                  /**< \brief Bitfield access */
} Ifx_XBAR_DBSAT;

